<!DOCTYPE html>
<html>
    <head>
        <title>Projekt Graffiti: Ganob - Home</title>
        <link rel="stylesheet" href="../../css/style.css">
        <script src="..\..\js\javaScript.js"></script>
    </head>
    <body>
        <div class="nav">
            <a href="../darkMode/ausbildungBeruf.html"><img src="../../img/changeMode.gif" alt="changeMode" width="135px" class="ChangeMode"></a>
            <div class="sidenav" id="mySidenav">
                <a href="javascript:void(0)" class="closebtn" onclick="closeNav()">&times;</a>
                <a href="../../index.html">Home</a>
                <a href="../lightMode/ausbildungBeruf.html" class="activePage">Ausbildung/Beruf</a>
                <a href="../lightMode/Berufswahl.html">Berufswahl</a>
                <a href="../lightMode/team.html">Team</a>
                <a href="../lightMode/basislehrjahr.html">Basislehrjahr</a>
                <a href="../lightMode/kontakt.html">Kontakt</a>
            </div>
            <img src="..\..\img\NavBarColapsed.gif" alt="navBarOpen" onclick="openNav()" class="navBarColapsed">
        </div>
        <p></p>
        <p></p>
            <h1>Einblick in die Ausbildung</h1>
        <div class="Text_light">
            <br>
            <h2>Was man als Informatiker macht:</h2>
            <p>In der Lehre als Informatiker hat man viel Abwechslung, weil man immer andere Aufgaben bekommt, oder man ein neues Problem bekommt, welches man l&ouml;sen muss. Die Informatik wird von Jahr zu Jahr immer st&auml;rker gefordert und dies wird sich in naher Zukunft auch nicht ver&auml;ndern. Informatik ist der Grundbau f&uuml;r die ganze Technologie und weil die Welt sich immer weiterentwickelt, wird der Beruf auch unverzichtbar gemacht, weil ohne die Informatik heutzutage nichts mehr funktionieren w&uuml;rde. In der Informatik gibt es Drei verschiedene Abteilungen. Diese heissen: Applikationsentwickler, Systemtechniker und Betriebsinformatiker. </p>
            <br>
            <hr>
            <br>
            <h2>Applikationsentwickler</h2>
            <br>
            <p>Ein Applikationsentwickler ist f&uuml;r das Realisieren einer Applikation zust&auml;ndig. Er plant und realisiert meist in einem Team eine ganze Applikation oder ein Teil davon. Sein Verantwortungsbereich umfasst den gesamten Entwicklungsbereich. Dies bedeutet vom Anfang mit dem Design bis zur Realisierung des Endproduktes. </p>
            <p>Ein Applikationsentwickler ist daf&uuml;r zust&auml;ndig, dass alle Mitarbeiter die richtigen Kenntnisse f&uuml;r den richtigen Umgang mit Sicherheitsfragen besitzen und somit im Internet immer sicher unterwegs sind. </p>
            <p>Als Applikationsentwickler sollte man sicherlich die F&auml;higkeit besitzen, einem Kunden sehr gut zuzuh&ouml;ren und sich die wichtigsten Informationen schnell aufzuschreiben, damit man den Auftrag genau versteht und es am Ende nicht ein falsches Produkt gibt, welches der Kunde dann nicht m&ouml;chte. Man sollte sich auch um Ordnung k&uuml;mmern und hiermit meinen wir nicht um Ordnung zuhause, sondern in einem Dokument, damit man beim Programmieren nicht schnell den &Uuml;berblick verliert und das Dokument auch noch nach zwei Jahren verstehen und auch nachvollziehen kann.</p>
            <p>Die Lehre geht vier Jahre lang und in diesen Jahren hat man als Applikationsentwickler 35 Tage lang &uuml;berbetriebliche Kurse, welche man meist schon im Basislehrjahr absolviert und somit in den restlichen drei Jahren keine &uuml;Ks mehr hat.</p>
            <p>Um eine Ausbildung als Informatik Applikationsentwickler EFZ abschliessen zu k&ouml;nnen, sollte man sich mit den Programmiersprachen C, C++, C# und Java auskennen. Man sollte einige Erfahrungen mit Kunden gehabt haben und das ein oder andere Projekt wie z.B. eine Webseite abgeschlossen haben. </p>
            <br>
            <hr>
            <br>
            <h2>Systemtechniker</h2>
            <br>
            <p>Ein Systemtechniker ist f&uuml;r die ganze Funktionalit&auml;t verschiedener Hardwarekomponenten zust&auml;ndig. Er ist deshalb auch f&uuml;r die ganze Installation, Wartung und Planung des Systems zust&auml;ndig. </p>
            <p>Der Systemtechniker ist f&uuml;r die komplette IT-Infrastruktur im Hardwarebereich zust&auml;ndig und in diesem Sinne plant, organisiert und f&uuml;hrt er Projekte aus. Ein Systemtechniker ist auch f&uuml;r den Kundenkontakt zust&auml;ndig und k&uuml;mmert sich somit um die Anwender der Infrastruktur. Er sorgt daf&uuml;r, dass die Support-Anfragen bearbeitet werden und dem Anwender geholfen wird.</p>
            <p>Damit alle Schritte beim Support nachvollziehbar sind, muss der Systemtechniker vieles Dokumentieren und gr&uuml;ndlich festhalten, damit man den Fehler das n&auml;chste Mal schneller und besser beheben kann. Man sollte sich um eine gute Informationssammlung scheren, damit man in sp&auml;terer Zeit den Auftrag sich durchlesen kann und direkt beginnen k&ouml;nnte, als ob keine Zeit vergangen w&auml;re. Somit verliert man keine unn&ouml;tige Zeit und kann effizient arbeiten.</p>
            <p>Die Lehre als Systemtechniker geht vier Jahre lang, wobei man 35 Tage lang &uuml;berbetriebliche Kurse betreibt. Diese &uuml;Ks hat man, falls man in einem Basislehrjahr ist alle im ersten Lehrjahr, damit man sp&auml;ter in der Lehre diese nicht mehr absolvieren muss. </p>
            <p>Damit man eine Ausbildung als Systemtechniker abschliessen kann, sollte man sich nicht nur gut mit der Hardware, sondern auch sehr gut mit der Software eines Computers auskennen. Man sollte einige Erfahrungen im Support gesammelt haben und sich mit Betriebssystemen, Serverlandschaften und Datenbanken gut zurechtfinden k&ouml;nnen. </p>
            <br>
            <hr>
            <br>
            <h2>Betriebsinformatiker</h2>
            <br>
            <p>Ein Betriebsinformatiker wird in jedem Betrieb anders eingesetzt, jedoch ist er meistens f&uuml;r die Kunden zust&auml;ndig. Er hilft Kunden mit komplexen Informatik-Problemen und l&ouml;st diese auch. Er entwickelt unterschiedliche fachliche Schwerpunkte oder nimmt neue Ger&auml;te in Betrieb, installiert und konfiguriert Server oder betreut Netzwerke. Er stellt zudem auch PC-Arbeitspl&auml;tze bereit, indem er Hardware und Software installiert, Netzwerke (LAN, WLAN) in Betrieb nimmt 6und entwickelt diese weiter w&auml;hrend er sie &uuml;berwacht. Es gibt noch viele weitere Arbeiten, welche ein Betriebsinformatiker hat, aber es kommt immer auf den Betrieb darauf an, was er zu tun hat.  </p>
            <p>Als Betriebsinformatiker sollte man immer auf knifflige Aufgaben gefasst sein und deshalb auch immer alles gr&uuml;ndlich Dokumentieren, damit man auf ein altes Problem zugreifen kann, wenn ein &auml;hnliches auftreten sollte. Eine gute Dokumentation ist auch sehr n&uuml;tzlich f&uuml;r Mitarbeiter, falls diese ein Problem haben, welches du schon einmal gel&ouml;st hast und sie somit ihrem Kunden schnell weiterhelfen k&ouml;nnen.</p>
            <p>Die Lehre als Betriebsinformatiker geht vier Jahre lang, wobei man 35 Tage lang &uuml;berbetriebliche Kurse betreibt. Diese &uuml;Ks absolviert man meist schon im Basislehrjahr, falls man in einem ist. Wenn man alle im Basislehrjahr absolviert, muss man im Rest der Lehre nicht mehr keine mehr besuchen.</p>
            <p>Um die Ausbildung als Betriebsinformatiker abschliessen zu k&ouml;nnen, sollte man sich mit der Hardware aber auch mit der Software eines Computers auskennen. Man sollte sich mit einigen Programmiersprachen auskennen, wie z.B. C oder C++ und sicherlich einige gute Erfahrungen mit Kunden gesammelt haben. </p>
            <br>
            <hr>
            <br>
            <h2>ICT-Fachmann</h2>
            <br>
            <p>Als ICT Fachmann betreut man meist selbstst&auml;ndig oder in Zusammenarbeit mit weiteren Fachpersonen die Kunden. Man arbeitet im ICT-Support und unterst&uuml;tzt dort Anwender und Anwenderinnen im Umgang mit ICT-Mitteln, wie Computer, Notepad, etc. Man installiert zus&auml;tzlich noch die Hard- und Software, erweitert einige Ger&auml;tekonfigurationen und wartet die ICT-Benutzerendger&auml;te. </p>
            <p>Man sollte sich als ICT-Fachmann mit der Hardware und Software des Betriebes auskennen, damit wenn ein Problem auftritt man dies rasch und gut l&ouml;sen kann ohne sich zu den Komponenten Informieren zu m&uuml;ssen.  </p>
            <p>Die Lehre als ICT-Fachmann/ICT-Fachfrau geht drei Jahre lang, wobei man 24 Tage &uuml;berbetriebliche Kurse absolvieren muss. Diese Tage hat man, falls man in einem Basislehrjahr ist alle im ersten Lehrjahr. </p>
            <p>F&uuml;r den Abschluss der Ausbildung sollte sich ein ICT-Fachmann/ICT-Fachfrau bestens mit der Software und Hardware eines Computers auskennen. Man sollte einige Erfahrungen im Support gesammelt haben, damit man sich direkt an die Arbeit machen k&ouml;nnte, falls sich ein Supportfall meldet. </p>
            <br>
            <hr>
            <br>
            <h2>Wie die Lehre aussehen wird</h2>
            <br>
            <p>Die Lehre als Informatiker ist je nach dem, in welchem Betrieb man arbeitet verschieden. In vielen Betrieben geht man zuerst in ein Basislehrjahr, wobei man viele Dinge erlernt, welche man f&uuml;r sp&auml;ter ben&ouml;tigen wird. Man bearbeitet jeweils f&uuml;r einige Wochen ein Thema und schliesst dies dann mit einer Pr&uuml;fung ab und geht dann zum n&auml;chsten Thema. </p>
            <p>Die Lehre kann sehr verschieden sein, was man macht. Man kann am Helpdesk arbeiten, man kann mit Kunden Kontakt aufnehmen und ihnen pers&ouml;nlich helfen, man kann am Schreibtisch sitzen und im Gesch&auml;ft seine Aufgaben erledigen (je nach dem auf welchem Gebiet es ist) und noch vieles mehr. </p>
            <br>
            <hr>
            <hr>
        </div>
    </body>
</html>